emacs/.config/emacs/config.org
#+TITLE: Literate Emacs Config
#+AUTHOR: Jon Harder
#+STARTUP: show2levels

* Early init optimizations
** Disable built-in package.el
  #+begin_src emacs-lisp :tangle "early-init.el"
    ;; disable package.el in favor of straight.el
    (setq package-enable-at-startup nil)
  #+end_src

  #+RESULTS:

** Startup performance enhancements
   The aim here is to effectively disable the garbage collector during startup
   as emacs is not interactible during startup anyway. In the startup-hook we
   restore these settings to sensible values for runtime.

   #+begin_src emacs-lisp :tangle early-init.el
     (setq gc-cons-threshold most-positive-fixnum
	    gc-cons-percentage 0.5)
   #+end_src

** Performance monitoring
  It's helpful to track how long Emacs takes to load up. This normally
  isn't the most critical metric to track as I usually run emacs with
  ~emacs --daemon~, and open new emacs windows with ~emacsclient~, but
  helpful nonetheless.

  #+begin_src emacs-lisp :tangle "early-init.el"
    (add-hook 'emacs-startup-hook
	      (lambda ()
		(setq gc-cons-threshold (* 1024 1024 20)
		      gc-cons-percentage 0.2)
		(message "*** Emacs loaded in %s with %d garbage collections."
			 (format "%.2f seconds"
				 (float-time
				  (time-subtract after-init-time before-init-time)))
			 gcs-done)))
  #+end_src

* Package management
** Set up straight.el (package management)

   #+begin_src emacs-lisp :tangle "init.el"
   (setq straight-repository-branch "develop")
   
   (defvar bootstrap-version)
   (let ((bootstrap-file
          (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
         (bootstrap-verision 6))
     (unless (file-exists-p bootstrap-file)
       (with-current-buffer
   	(url-retrieve-synchronously
   	 "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
   	 'silent 'inhibit-cookies)
         (goto-char (point-max))
         (eval-print-last-sexp)))
     (load bootstrap-file nil 'nomessage))
   #+end_src
** Local lisp loading
*** Adding my-modules to the load path
    #+begin_src emacs-lisp :tangle "init.el"
    (add-to-list 'load-path (locate-user-emacs-file "my-modules"))
    #+end_src

*** Require all my modules
    #+begin_src emacs-lisp :tangle "init.el"
      (require 'my-appearance)
      (require 'my-core)
      (require 'my-evil-config)
      (require 'my-bindings)

      (require 'my-calendar)
      (require 'my-completion)
      (require 'my-denote)
      (require 'my-dired)
      (require 'my-docker-mode)
      (require 'my-email)
      (require 'my-epub)
      (require 'my-gpg)
      (require 'my-help)
      (require 'my-http)
      (require 'my-ibuffer)
      (require 'my-icons)
      (require 'my-lisp-mode)
      (require 'my-magit)
      (require 'my-markup)
      (require 'my-navigation)
      (require 'my-nushell-mode)
      (require 'my-org)
      (require 'my-php-mode)
      (require 'my-prog-mode)
      (require 'my-python-mode)
      (require 'my-rest-mode)

      (require 'my-rust-mode)
      (require 'my-search)
      (require 'my-shells)
      (require 'my-terraform-mode)
      (require 'my-util)
      (require 'my-vim-mode)
      (require 'my-xref)
    #+end_src

* Appearance
** Color theme
#+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
  (defvar jh-theme 'ef-winter
    "A symbol defining which color theme to load.")
#+end_src

   The modus theme set is the most complete and polished emacs color theme I've
   encountered. It's also WCAG 2 compliant meaning it will always have high color
   contrast between UI elements, making it one of the easiest themes on the eyes
   in any lighting situation.

*** Settings

**** Modus themes settings
     #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
      (progn ;; Modus configuration
	(require-theme 'modus-themes)
	(setq modus-themes-completions
	      '((matches . (extrabold underline))
		(selection . (semibold italic))))
	(setq modus-themes-prompts '(bold))
	(setq modus-themes-bold-constructs t)
	(setq modus-themes-common-palette-overrides
	      modus-themes-preset-overrides-intense)
	(setq modus-themes-variable-pitch-ui nil)
	(setq modus-themes-italic-constructs t)
	(setq modus-themes-org-blocks 'gray-background)
	(setq modus-themes-headings
	      '((1 . (variable-pitch 1.5))
		(2 . (1.3))
		(agenda-date . (1.3))
		(agenda-structure . (variable-pitch light 1.8))
		(t . (1.1)))))
    #+end_src

**** Ef-themes settings
    #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
      (straight-use-package 'ef-themes)
      (setq ef-themes-headings
	    '((1 . (variable-pitch 1.5))
	      (2 . (1.3))
	      (agenda-date . (1.3))
	      (agenda-structure . (variable pitch light 1.8))
	      (t . (1.1))))
    #+end_src

*** Load theme
    #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
      (load-theme jh-theme t)
   #+end_src

** Tweak display of UI elements
*** Menu bar mode

   The menu bar is the list of contextual dropdown options in the top of the
   application (or in the universal top bar on macs).

   I'm all for getting rid of UI clutter, especially if it's unused, but there
   are a lot of features in emacs... Having contextual help aids discoverability,
   and so it stays on.
   
   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (menu-bar-mode 1)
   #+end_src
   
*** Scroll bar mode
   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (scroll-bar-mode -1)
   #+end_src
*** Tool bar mode
   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (tool-bar-mode -1)
   #+end_src

** Frame settings
   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (setq frame-resize-pixelwise t
	   frame-inhibit-implied-resize t
	   inhibit-splash-screen t
	   inhibit-startup-screen t)
   #+end_src
** Bells are evil
   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (setq ring-bell-function 'ignore)
   #+end_src
** Time display

*** Format
    I like 24 hour time; one time being ambiguous is unnecessarily cumbersome.

   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
      (setq display-time-24hr-format t)
    #+end_src

*** Add the time to the mode line

   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (display-time)
   #+end_src

** Font

   I use FiraCode patched with the Nerd icons

   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (let ((font "FiraCode Nerd Font")
	   (size 140))
       (set-face-attribute 'default nil :font font :height size)
       (set-frame-font font nil t)
       (add-to-list 'default-frame-alist
		    `(font . ,font)))
   #+end_src

** Tabs
   Tabs are a useful workspace organization concept. You can have discrete window/buffer arrangements per tab,
   allowing you to switch between them at will. They are pretty flexible so you could use them for keeping
   track of different projects. Or you could have different window configuations for the same set of buffers
   on different tabs to help with different types of work within the same project.

   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (setq tab-bar-show 1)
   #+end_src
** Spacious Padding
   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (straight-use-package 'spacious-padding)
   #+end_src

** provide the module
  #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
    (provide 'my-appearance)
  #+end_src
* Base settings
** Customization file

  Here's just a holding ground for general emacs settings that
  don't seem to fit in any more specific location.

  When emacs makes customizations on my behalf, it throws the
  resultant elist code into my init file. It's great that it
  produces visible, editable, version controllable config, but
  I don't like it in my init file. Let's move it somewhere else.

  #+begin_src emacs-lisp :tangle "my-modules/my-core.el" :mkdirp yes
    (setq custom-file (concat user-emacs-directory "custom.el"))
  #+end_src

** Backups

  Emacs helpfully creates local backups of any files you're editing so that
  if something happens to your session before saving the file, you'll have
  a backup of the local changes.

  It *un*-helpfully defaults to placing them in the same directory as the file
  you are editing. This clutters things up immensely, particularily when you
  are working in a version-controlled project and have to tell your VC tool
  to ignore them.

  Much better to just place them in a dedicated directory and forget about them.
  Emacs will still save the day if something happens, but you don't have to
  worry about it.

  #+begin_src emacs-lisp :tangle "my-modules/my-core.el" :mkdirp yes
    (setq backup-directory-alist '(("." . "~/.backups")))
  #+end_src

** Dictionary

   Emacs has built in dictionary support (because of course it does). By dafault, it
   expects you to be running a dictionary server ~dictd~ locally. If it can't be found,
   it falls back to [[dict.org]]. I'm fine with going over the wire for my definitions,
   so let's just set it as default.

   #+begin_src emacs-lisp :tangle "my-modules/my-core.el" :mkdirp yes
     (setq dictionary-server "dict.org")
   #+end_src

** Provide the module

   #+begin_src emacs-lisp :tangle "my-modules/my-core.el" :mkdirp yes
     (provide 'my-core)
   #+end_src

* Evil (vim)

  Evil mode is the backbone of this configuration. Coming from years
  of vim use, modal editing is burned into my brain stem.

  Fortunately, emacs has some of the best vim emulation of any editor
  or environment around in the way of ~evil-mode~.

** Install the package and enable it

  #+begin_src emacs-lisp :tangle "my-modules/my-evil-config.el" :mkdirp yes
    (straight-use-package 'evil)
    (setq evil-vsplit-window-right t)
    (setq evil-split-window-below t)
    (setq evil-undo-system 'undo-redo)
    (evil-mode 1)
  #+end_src

** Starting state for major modes

   Sometimes I want to have some evil state other than =normal= for a particular
   major mode, or the mode might not start in =normal= mode for some reason.
   Regardless, configure thes modes with the desired initial state.

   #+begin_src emacs-lisp :tangle "my-modules/my-evil-config.el" :mkdirp yes
     (defvar my-normal-modes
       '(Info-mode
	 Man-mode
	 magit-log-mode
	 occur-mode
	 magit-revision-mode
	 ibuffer-mode
	 calendar-mode
	 org-agenda-mode
	 grep-mode)
       "Modes for which evil should begin in normal mode.")

     (defvar my-insert-modes
       '(vterm-mode
	 eshell-mode
	 eat-mode)
       "Modes for which evil should begin in insert mode.")

     (defvar my-emacs-modes '()
       "Modes to start in native emacs mode.")

     (dolist (mode my-normal-modes)
       (evil-set-initial-state mode 'normal))

     (dolist (mode my-insert-modes)
       (evil-set-initial-state mode 'insert))


     (dolist (mode my-emacs-modes)
       (evil-set-initial-state mode 'emacs))
   #+end_src

** Cursor shape/color

   It's helpful to set the cursor to different colors and shapes to help remind
   me what evil state I'm currently in.

   /NOTE:/ is there a way to set these colors to something theme compatible?

   #+begin_src emacs-lisp :tangle "my-modules/my-evil-config.el" :mkdirp yes
     (setq evil-normal-state-cursor '(box "light blue")
	   evil-insert-state-cursor '(bar "medium sea green")
	   evil-visual-state-cursor '(hollow "orange"))
   #+end_src

** Leader key

  The leader key is a super handy global prefix for keybindings.
  It's used in this configuration as the entrypoint for most bindings.

  After entering the leader key =SPC=, bindings are further subdivided
  by the logical operations or object those bindings act on.

  | _binding_ | _action_                           |
  |---------+----------------------------------|
  | SPC a   | application launcher             |
  | SPC b   | buffer actions                   |
  | SPC c   | config actions                   |
  | SPC d   | dired actions                    |
  | SPC e   | evaluation actions               |
  | SPC f   | file based actions               |
  | SPC g   | magit                            |
  | SPC h   | help actions                     |
  | SPC m   | [reserved] mode specific actions |
  | SPC o   | org actions                      |
  | SPC t   | tab actions                      |
  | SPC w   | window based actions             |

  #+begin_src emacs-lisp :tangle "my-modules/my-evil-config.el" :mkdirp yes
    (evil-set-leader 'normal (kbd "<SPC>"))
  #+end_src

** Evil surround
  #+begin_src emacs-lisp :tangle "my-modules/my-evil-config.el" :mkdirp yes
    (straight-use-package 'evil-surround)
    (global-evil-surround-mode 1)
  #+end_src

** Evil numbers

   For some reason, vim's increment and decrement number functionality
   is not replicated by evil. This package just re-introduces that
   behavior

   #+begin_src emacs-lisp :tangle "my-modules/my-evil-config.el" :mkdirp yes
     (straight-use-package 'evil-numbers)
     (define-key evil-normal-state-map (kbd "C-a") #'evil-numbers/inc-at-pt)
     (define-key evil-normal-state-map (kbd "C-x") #'evil-numbers/dec-at-pt)
   #+end_src

** Provide the module
  
   #+begin_src emacs-lisp :tangle "my-modules/my-evil-config.el" :mkdirp yes
     (provide 'my-evil-config)
   #+end_src

* Calendar
** Base settings

   Set the date style to iso (day month year).

   #+begin_src emacs-lisp :tangle "my-modules/my-calendar.el" :mkdirp yes
     (setq calendar-date-style 'iso)
   #+end_src
** Bindings
   #+begin_src emacs-lisp :tangle "my-modules/my-calendar.el" :mkdirp
     (evil-define-key 'normal calendar-mode-map
       (kbd "l") 'calendar-forward-day
       (kbd "h") 'calendar-backward-day
       (kbd "w") #'calendar-forward-week
       (kbd "b") #'calendar-backward-week
       (kbd "k") 'calendar-backward-week
       (kbd "j") 'calendar-forward-week
       (kbd "q") 'calendar-exit
       (kbd "0") 'calendar-beginning-of-week
       (kbd "$") 'calendar-end-of-week
       (kbd ".") 'calendar-goto-today
       (kbd "d d") 'diary-view-entries
       (kbd "d i") 'diary-insert-entry)
   #+end_src
** Diary

   The diary is (for me) mostly a way to jot down an appointment or reminder.

  #+begin_src emacs-lisp :tangle "my-modules/my-calendar.el" :mkdirp yes
     (appt-activate 1)

     (evil-define-key 'normal diary-fancy-display-mode-map
       (kbd "q") 'quit-window)
   #+end_src

** Provide the module

  #+begin_src emacs-lisp :tangle "my-modules/my-calendar.el" :mkdirp yes
    (provide 'my-calendar)
  #+end_src
* Completion

