emacs/.config/emacs/config.org
** General minibuffer settings

   When interacting with the [[elisp:(info "(emacs) Minibuffer")][minibuffer]], you may want to execute a command
   that itself occupies the minibuffer. Enabling recursive-minibuffers allows
   for you to nest arbitrarily deep minibuffer commands.

   #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
     (setq enable-recursive-minibuffers t)
   #+end_src

   When you've used a command once, you will probably use it again in the near
   future. savehist is a simple package that remembers and promotes recent
   commands to the top of the prompted list of completions.

   #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
     (straight-use-package 'savehist)
     (savehist-mode)
   #+end_src

** Vertico

   Vertico is a minibuffer completion enhancement library which wraps emacs'
   built in [[elisp:(info "(emacs) Completion")][completion]] functionality. It is a member of a new era of packages
   which seek to enhance existing methods in emacs, rather than replace them
   entirely (looking at you helm).

   Vertico specifically seeks to enhance `completing-read', a generic method
   that prompts users to select from one of a provided set of alternatives.

   #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
     (straight-use-package 'vertico)
     (vertico-mode 1)
     (define-key vertico-map (kbd "<escape>") #'keyboard-escape-quit)
   #+end_src

   Vertico also has a small stable of add-ons which change the default
   UI or behavior of vertico. Here vertico-directory is enabled, which
   introduces commands to delete directories fragments of the prompted
   file-path.

   #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
     (require 'vertico-directory)
     (define-key vertico-map (kbd "DEL") #'vertico-directory-delete-char)
     (define-key vertico-map (kbd "RET") #'vertico-directory-enter)
   #+end_src

** Corfu

  Corfu offers completion in buffer, replacing company mode which sidesteps
  Emacs' built in completion mechanisms.

  #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
    (straight-use-package 'corfu)
    (setq corfu-auto t
	  corfu-separator ?\s
	  tab-always-indent 'complete)
    (global-corfu-mode 1)
  #+end_src

** Marginalia

   Marginalia is a small package that adds contextual information "in the margins"
   of the completion. It is a perfect compliment to the work of vertico (or
   other completion frameworks, it doesn't care)

   This means file prompts will contain file permissions, last modified time,
   file size. Commands will display their doc string, etc.

  #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
     (straight-use-package 'marginalia)
     (marginalia-mode 1)
   #+end_src

** Orderless

   The orderless package allows for fuzzy searching of terms sepparated by spaces
   (by default) and finds results regardless of search term order, thus, orderless.

  #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
     (straight-use-package 'orderless)
     (setq completion-styles '(orderless basic)
	   completion-category-defaults nil
	   completion-category-overrides '((file (styles partial-completion))))
   #+end_src
   
** Consult

  #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
    (straight-use-package 'consult)
  #+end_src

** Embark

    It's kinda like right click, for your keyboard.
    Activating embark gives you a context-aware menu
    of actions to perform on the target under point.

    #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
      (straight-use-package 'embark)
      (straight-use-package 'embark-consult)
      (setq prefix-help-command #'embark-prefix-help-command)
      (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
      (evil-define-key '(normal motion visual insert emacs) 'global
	(kbd "s-<return>") #'embark-dwim
	(kbd "C-<return>") #'embark-act)
      (define-key minibuffer-local-map
	(kbd "C-<return>") #'embark-act)
    #+end_src
   
** Provide the module
    #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
      (provide 'my-completion)
    #+end_src
 
* Icons
** Set up all the icons
  #+begin_src emacs-lisp :tangle "my-modules/my-icons.el" :mkdirp yes
    ;; Icons
    (straight-use-package 'all-the-icons)
    ;;; If icons aren't showing up, you may need to install the font.
    ;;; If so, uncomment and execute the following line.
    ;; (all-the-icons-install-fonts t)
#+end_src

** And completion support for all the icons

#+begin_src emacs-lisp :tangle "my-modules/my-icons.el" :mkdirp yes
    (straight-use-package 'all-the-icons-completion)
    (all-the-icons-completion-mode)
    (if (require 'marginalia nil nil)
	(add-hook 'marginalia-mode-hook #'all-the-icons-completion-marginalia-setup))
#+end_src

** Provide the module

#+begin_src emacs-lisp :tangle "my-modules/my-icons.el" :mkdirp yes
    (provide 'my-icons)
  #+end_src 

* Denote
** Basic settings

  #+begin_src emacs-lisp :tangle "my-modules/my-denote.el" :mkdirp yes
    (straight-use-package 'denote)

    (denote-rename-buffer-mode 1)
    (setq denote-known-keywords '("emacs" "work" "article" "notes" "blog"))

    (setq denote-directory (expand-file-name "~/Dropbox/notes"))
    (setq denote-dired-directories
	  (list (expand-file-name denote-directory)))
    (setq denote-prompts '(title subdirectory keywords signature))
  #+end_src

** Bindings

   #+begin_src emacs-lisp :tangle "my-modules/my-denote.el" :mkdirp yes
     (evil-define-key 'normal 'global
       (kbd "<leader> n b") #'denote-backlinks
       (kbd "<leader> n f") #'denote-open-or-create
       (kbd "<leader> n j") #'denote-journal-extras-new-or-existing-entry
       (kbd "<leader> n l") #'denote-link
       (kbd "<leader> n n") #'denote
       (kbd "<leader> n r") #'denote-rename-file
       (kbd "<leader> n J") #'denote-journal-extras-new-entry)
   #+end_src

** Journaling
   #+begin_src emacs-lisp :tangle "my-modules/my-denote.el" :mkdirp yes
     (require 'denote-journal-extras)
     (setq denote-journal-extras-directory (concat denote-directory "/journal"))
     (add-to-list 'denote-dired-directories denote-journal-extras-directory)
   #+end_src

** Silos
   Silos are a way to fully sepparate notes from each other. In order
   to fully support them, we'll need to tell denote where each silo
   lives.

   #+begin_src emacs-lisp :tangle "my-modules/my-denote.el" :mkdirp yes
     (require 'denote-silo-extras)
     (let ((my-silo-dirs (list
			  (expand-file-name
			   "~/Dropbox/Personal"))))
       (dolist (dir my-silo-dirs)
	 (add-to-list 'denote-silo-extras-directories dir)
	 (add-to-list 'denote-dired-directories dir)))
   #+end_src

** Hooks
   #+begin_src emacs-lisp :tangle "my-modules/my-denote.el" :mkdirp yes
    (add-hook 'dired-mode-hook #'denote-dired-mode-in-directories)
   #+end_src

** Provide the module
   #+begin_src emacs-lisp :tangle "my-modules/my-denote.el" :mkdirp yes
    (provide 'my-denote)
   #+end_src

* Dired

  The Dir(ectory) Ed(itor). [[elisp:(info "(emacs) Dired")][Dired]] is a text based file manager, baked into
  emacs. It uses the modest [[man:ls][ls]] command to generate the directory listing,
  and adds a ton of functionality on top, allowing for inteligent commands
  to operate on the seleted file(s). This only scratches the surface of
  what it can do, so seriously, read the info doc.

** Settings

   #+begin_src emacs-lisp :tangle "my-modules/my-dired.el" :mkdirp yes
     (setq dired-kill-when-opening-new-dired-buffer t) 
     (require 'dired)
     (setq dired-listing-switches "-hAFl")
     ;; this pre-fills the destination prompt of copy and rename
     ;; commands with the directory of the other dired buffer
     ;; if one is open. Very handy
     (setq dired-dwim-target t)

     ;; don't show all the file details by default
     ;; They're still accessible with '('
     (add-hook 'dired-mode-hook 'dired-hide-details-mode)
   #+end_src

   I want to be able to toggle the display of dotfiles in dired. This function allows me to
   do exactly that.

   #+begin_src emacs-lisp :tangle "my-modules/my-dired.el" :mkdirp yes
     (defun dired-dotfiles-toggle ()
       (interactive)
       (when (equal major-mode 'dired-mode)
	 (if (or (not (boundp 'dired-dotfiles-show-p)) dired-dotfiles-show-p)
	     (progn
	       (set (make-local-variable 'dired-dotfiles-show-p) nil)
	       (message "h")
	       (dired-mark-files-regexp "^\\\.")
	       (dired-do-kill-lines))
	   (progn (revert-buffer)
		  (set (make-local-variable 'dired-dotfiles-show-p) t)))))
   #+end_src
** Bindings

    #+begin_src emacs-lisp :tangle "my-modules/my-dired.el" :mkdirp yes
      (define-key dired-mode-map (kbd "SPC") nil)
      (evil-define-key '(normal motion) dired-mode-map
	(kbd "j") #'dired-next-line
	(kbd "k") #'dired-previous-line
	(kbd "h") #'dired-up-directory
	(kbd "l") #'dired-find-file
	(kbd "n") #'evil-search-next
	(kbd "N") #'evil-search-previous
	(kbd "s") #'eshell
	(kbd "g o") #'dired-insert-subdir
	(kbd "g d") #'dired-kill-subdir
        (kbd "g j") #'dired-next-subdir
        (kbd "g k") #'dired-prev-subdir
	(kbd "z a") #'dired-dotfiles-toggle
	(kbd ".") #'dired-dotfiles-toggle
	(kbd "g g") #'dired-first-file
	(kbd "G") #'dired-last-file
	(kbd "<left>") #'dired-up-directory
	(kbd "<right>") #'dired-find-file
	(kbd "<up>") #'dired-previous-line
	(kbd "<down>") #'dired-next-line)
    #+end_src
** Helper functions
  
   #+begin_src emacs-lisp :tangle "my-modules/my-dired.el" :mkdirp yes
     (defun dired-first-file ()
       "Jump the point to the first dired entry that isn't . or .."
       (interactive)
       (beginning-of-buffer)
       (dired-next-line 3))

     (defun dired-last-file ()
       "Jump the point to the last dired entry."
       (interactive)
       (end-of-buffer)
       (dired-next-line -1))

   #+end_src

** dired-preview

   sometimes it's handy to preview the file under point as you're navigating
   a directory. dired-preview allows for exactly this behavior.

   #+begin_src emacs-lisp :tangle "my-modules/my-dired.el" :mkdirp yes
     (straight-use-package 'dired-preview)
     (setq dired-preview-delay 0.2)
     (evil-define-key 'normal dired-mode-map
       (kbd "P") #'dired-preview-global-mode)
   #+end_src

** Icons

  #+begin_src emacs-lisp :tangle "my-modules/my-dired.el" :mkdirp yes
    (straight-use-package 'all-the-icons-dired)
    (add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
    (setq all-the-icons-dired-monochrome nil)
  #+end_src

** Provide the module

  #+begin_src emacs-lisp :tangle "my-modules/my-dired.el" :mkdirp yes
    (provide 'my-dired)
  #+end_src
  
* GPG (egp)

  GPG allows you to easily encrypt/decrypt files with either symmetric
  (shared key) or asymetric (private key) encryption.

  Emacs hooks into this seemlessly by automatically decrypting encrypted
  files automatically when opening them using any loaded encyption keys
  you have on the system.

** Disable waiting for status

  There is an outstanding bug in epg where waiting for the enryption status
  will hang, which blocks the whole editor. We can disable this for now.

  #+begin_src emacs-lisp :tangle "my-modules/my-gpg.el" :mkdirp yes
    (fset 'epg-wait-for-status 'ignore)
  #+end_src

** PIN entry

  PIN entry is used to authorize a gpg key for use. By default emacs will
  reach out to an external proccess to prompt for the PIN. But this is
  emacs, let's make emacs do it.

  #+begin_src emacs-lisp :tangle "my-modules/my-gpg.el" :mkdirp yes
    (setq epg-pinentry-mode 'loopback)
  #+end_src

** Provide the module
  
  #+begin_src emacs-lisp :tangle "my-modules/my-gpg.el" :mkdirp yes
    (provide 'my-gpg)
  #+end_src

* Http server (simple-httpd)
  This allows emacs to spin up a local http server to serve local
  files on the filesystem.

** Add the package
  #+begin_src emacs-lisp :tangle "my-modules/my-http.el" :mkdirp yes
    (straight-use-package 'simple-httpd)
  #+end_src

** Provide the module

  #+begin_src emacs-lisp :tangle "my-modules/my-http.el" :mkdirp yes
    (provide 'my-http)
  #+end_src

* Epub support
** Load nov mode and associate it with .epub files
   #+begin_src emacs-lisp :tangle "my-modules/my-epub.el" :mkdirp yes
     (straight-use-package 'nov)
     (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
   #+end_src

** Provide the module
   #+begin_src emacs-lisp :tangle "my-modules/my-epub.el" :mkdirp yes
     (provide 'my-epub)
   #+end_src

* Programming
** Prog mode
    Emacs has a general ~prog~ mode, serving as the base major mode for
    all language specific programming modes. Adding settings and hooks
    for this mode means they will be set for all programming languages.

*** Rainbow delimiters
   
    Highlight netsted delimeters with unique colors so you can tell
    at a glance how deep you are.


    #+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
      (straight-use-package 'rainbow-delimiters)
      (add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
    #+end_src

*** Eglot

   Language server client implimentation. Comes baked into emacs starting
   at version 29.

   There seems to be a bug with the latest version of `menu-bar' (maybe?
   or perhaps in `project'?)

   Eglot attempts to insert itself info the menu bar, but the project
   entry in the menu bar is not defined. Setting this variable to ~nil~
   resolves the immediate issue causing ~eglot~ to crash. It is unknown
   what downstream ramifications this actually causes.

   #+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
     (defvar menu-bar-project-menu '())
   #+end_src

   #+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
     (add-hook 'eglot-managed-mode-hook
	       (lambda ()
		 (setq eldoc-documentation-strategy #'eldoc-documentation-compose)
		 (setq eldoc-documentation-functions
		       '(flymake-eldoc-function
			 eglot-signature-eldoc-function
			 eglot-hover-eldoc-function))))
   #+end_src

   And for support for languages that aren't pre-configured out of
   the box by eglot:

   #+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
     (with-eval-after-load 'eglot
       (add-to-list 'eglot-server-programs
		    `(terraform-mode . ("terraform-ls" "serve"))))
   #+end_src

*** Highlight TODO statements

   #+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
     (straight-use-package 'hl-todo)
     (global-hl-todo-mode 1)
   #+end_src
*** Electric pair mode
   This is a fairly simple mode that automatically inserts the matching symbol. =)= after typing =(=
   for instance.

   #+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
     (electric-pair-mode 1)
   #+end_src
*** Provide =my-prog-mode=
   #+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
     (provide 'my-prog-mode)
   #+end_src
    
** Rest mode
   Run http commands using simple http spec

   #+begin_src emacs-lisp :tangle "my-modules/my-rest-mode.el" :mkdirp yes
     (straight-use-package 'restclient)
     (add-to-list 'auto-mode-alist '("\\.http\\'" . restclient-mode))
     (provide 'my-rest-mode)
   #+end_src
 
