emacs/.config/emacs/config.org
** Basic config

   This sets which shell to use when executing commands from dired or compile and friends
   This is different from the shell to use in interactive sessions.

   Because I use [[https://www.nushell.sh][nushell]] for my shell, regular commands like [[man:find][find]] often choke when tools
   like dired assume the posix implementation.

   #+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
     (setq explicit-shell-file-name "/opt/homebrew/bin/nu"
           shell-file-name "/bin/zsh")
   #+end_src

** Eshell
*** Settings

    #+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
      (straight-use-package 'eshell-syntax-highlighting)
      (eshell-syntax-highlighting-global-mode +1)
      (require 'eshell)
      (require 'em-smart)
      (setq eshell-where-to-jump 'begin)
      (setq eshell-review-quick-commands nil)
      (setq eshell-smart-space-goes-to-end t)
      (setq eshell-visual-commands nil)
    #+end_src

*** Completion

    I want more intelligent completion in eshell.

    This provides smart docker completion, not only for available
    subcommands, but also for realtime completion of available
    images in particular for commands like `run'. 

    #+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
      (defconst pcmpl-docker-commands
	'("run" "exec" "ps" "build" "pull" "images" "login" "logout"
	  "search" "version" "info"
	  "compose"))

      (defvar docker-images-command "docker images | tail -n +2 | awk '{ if($1 != \"<none>\") { if($2 == \"<none>\") { print $1 } else { printf(\"%s:%s\\n\", $1, $2) } } }'")

      (defun pcmpl-docker-images ()
	(let ((results (shell-command-to-string docker-images-command)))
	  (string-split results "\n")))

      (defun pcomplete/docker ()
	"Completion for `docker'."
	(pcomplete-here* pcmpl-docker-commands)
	(cond
	 ((pcomplete-match (regexp-opt '("run")) 1)
	  (pcomplete-here* (pcmpl-docker-images)))))

    #+end_src
*** Custom functions
    #+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
      (defun eshell/f (&optional file)
	(interactive)
	(if file
	    (find-file file)
	  (call-interactively #'find-file)))

      (defun eshell/d (&optional dir)
	(interactive)
        (if dir (dired dir) (dired ".")))
    #+end_src
*** Prompt
    Because eshell is just elisp, the prompt can be set using elisp as well.
    This unlocks the full power of emacs as an environment and can be harnesed
    to make eshell as fancy as you can dream up (and program)

    #+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
      (setq eshell-prompt-function
	    (lambda ()
	      (let ((home-path (getenv "HOME")))
		(concat
		 (string-replace home-path "~" (eshell/pwd))
		 " $ "))))

      (setq eshell-prompt-regexp ".*$ ")
    #+end_src
** Eat
  [[https://codeberg.org/akib/emacs-eat][Eat]] is a new kind of shell for emacs, handling fully interactive, fullscreen terminal apps
  cleanly. I think it can replace vterm, and has the benefit of not needing system
  dependencies nor a compilation step.

  #+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
    (straight-use-package
     '(eat :type git
	   :host codeberg
	   :repo "akib/emacs-eat"
	   :files ("*.el" ("term" "term/*.el") "*.texi"
		   "*.ti" ("terminfo/e" "terminfo/e/*")
		   ("terminfo/65" "terminfo/65/*")
		   ("integration" "integration/*")
		   (:exclude ".dir-locals.el" "*-tests.el"))))
    (eat-eshell-mode 1)
  #+end_src
** Vterm

   #+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
     (straight-use-package 'vterm)
     (straight-use-package 'multi-vterm)
     (setq vterm-shell "/opt/homebrew/bin/nu")
   #+end_src
** Provide =my-shells=
   #+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
     (provide 'my-shells)
   #+end_src

* Navigation
** Windows

*** ace-window

    Ace window is a handy way to supercharge `other-window' by giving
    each option a lettered target. Simply pressing that letter jumps
    straight to the targeted window, without having to cycle through
    any intermediate windows in the cycle.

    #+begin_src emacs-lisp :tangle "my-modules/my-navigation.el" :mkdirp yes
      (straight-use-package 'ace-window)
    #+end_src

*** Window management

    Window management in emacs is very powerful, but oft misunderstood.
    Here are some rules to inform emacs of where I want particular windows
    to go.

    #+begin_src emacs-lisp :tangle "my-modules/my-navigation.el" :mkdirp yes
      (setq switch-to-buffer-obey-display-actions t)

      (add-to-list 'display-buffer-alist
		   '("\\*eshell\\*"
		     (display-buffer-at-bottom)
		     (side . bottom)
		     (slot . 0)
		     (window-height . 15)))

      (add-to-list 'display-buffer-alist
		   '("Calendar"
		     (display-buffer-below-selected)
		     (window-height . 15)))
    #+end_src

** Ace jump

  Ace jump is a fantastic package that allows you to jump to any point on the screen with 3
  key presses or less. It's like using your mouse to go wherever you need, but without
  moving your hands off the keyboard.

  #+begin_src emacs-lisp :tangle "my-modules/my-navigation.el" :mkdirp yes
    (straight-use-package 'ace-jump-mode)
  #+end_src

** Provide =my-navigation=
  #+begin_src emacs-lisp :tangle "my-modules/my-navigation.el" :mkdirp yes
    (provide 'my-navigation)
  #+end_src

* Email
** mbsync setup
  At this point you shouldn't be surprised to find that emacs has decent support for sending
  and receiving emails. It even has a mail retrieval utility built in, rmail.

  This setup requires ~isync~ to be installed on the host machine (a.k.a. the vestigial
  layer that separates emacs from the motherboard).

  *NOTE*: as of [2023-10-16], there is a known issue with mbsync pulling from (at least for gmail)
  remote inboxes. It runs for a time, then errors out with a socket error complaining about
  an unexpected EOF. This has been patched, but is not yet in the homebrew formula, so we install
  from =master=.

  ~brew install --HEAD isync~

  It also requires a mbsync configuration file to work correctly. [[file:~/.mbsyncrc][~/.mbsyncrc]]

** Notmuch
  *NEW* transitioning to notmuch

  #+begin_src emacs-lisp :tangle "my-modules/my-email.el" :mkdirp yes
    (straight-use-package 'notmuch)
  #+end_src

  from there just configure it

  src_sh[]{notmuch setup}

  and let notmuch index your mail

  src_sh[]{notmuch new}

  *OLD*, I'd like to transition from mu(4e) to notmuch, so the following
  is old
  
  for mu and mu4e to work, mu must be initialized with your maildir

  ~mu init --maildir=~/mail --my-address=jharder@kipsu.com~

  and then indexed:

  ~mu index~

  The mu package comes with the emacs package mu4e. Let's add it to
  the load path.

** Mu(4e) setup - OLD
  #+begin_src emacs-lisp :tangle "my-modules/my-email.el" :mkdirp yes
    (add-to-list 'load-path "/opt/homebrew/Cellar/mu/1.10.7/share/emacs/site-lisp/mu/mu4e")
    (require 'mu4e)

    (setq mu4e-attachments-dir "~/Downloads"
	  mu4e-maildir "~/Mail"
	  mu4e-get-mail-command "mbsync -a"
	  mu4e-refile-folder "/Archive"
	  mu4e-sent-folder "/Sent"
	  mu4e-drafts-folder "/Drafts"
	  mu4e-trash-folder "/Trash")

    (setq smtpmail-default-smtp-server "smtp.gmail.com"
	  smtpmail-smtp-server "smtp.gmail.com"
	  user-mail-address "jharder@kipsu.com")
  #+end_src

** Provide =my-email=
  #+begin_src emacs-lisp :tangle "my-modules/my-email.el" :mkdirp yes
    (provide 'my-email)
  #+end_src

* Miscellanious functions
  This is a collection of random functions I've written to help me run one-off tasks.
  
  #+begin_src emacs-lisp :tangle "my-modules/my-util.el" :mkdirp yes
    (defun find-config ()
      "Open the user's config file."
      (interactive)
      (find-file (concat user-emacs-directory "config.org")))

  #+end_src

  This is a small convenience method to load the mastering emacs epub:

  #+begin_src emacs-lisp :tangle "my-modules/my-util.el" :mkdirp yes
    (defun masteringemacs ()
      "Open the masteringemacs epub manual."
      (interactive)
      ;; ensure the nov package is installed
      (require 'nov)
      (find-file "~/Dropbox/Emacs/mastering-emacs-v4.epub"))
  #+end_src

  And provide the module

  
  #+begin_src emacs-lisp :tangle "my-modules/my-util.el" :mkdirp yes
    (provide 'my-util)
  #+end_src

* Magit (git)
  Magit is amazing

** Install the package

  #+begin_src emacs-lisp :tangle "my-modules/my-magit.el" :mkdirp yes
    (straight-use-package 'magit)
    (evil-set-initial-state 'magit-status-mode 'normal)
  #+end_src

** Set up bindings for the various magit modes
*** Status mode
    Normal mode bindings

    #+begin_src emacs-lisp :tangle "my-modules/my-magit.el" :mkdirp yes
      (evil-define-key '(normal motion) magit-status-mode-map
        (kbd "?") #'magit-dispatch
	(kbd "b") #'magit-branch
	(kbd "q") #'magit-mode-bury-buffer
	(kbd "c") #'magit-commit
	(kbd "j") #'magit-next-line
	(kbd "k") #'magit-previous-line
	(kbd "}") #'magit-section-forward
	(kbd "{") #'magit-section-backward
	(kbd "TAB") #'magit-section-toggle
	(kbd "RET") #'magit-visit-thing
	(kbd "i") #'magit-gitignore
	(kbd "l") #'magit-log
	(kbd "m") #'magit-merge
	(kbd "P") #'magit-push
	(kbd "p") #'magit-pull
	(kbd "r") #'magit-remote
	(kbd "R") #'magit-reset
	(kbd "$") #'magit-process-buffer
	;; delete
	(kbd "d d") 'magit-discard
	(kbd "z") #'magit-stash)
    #+end_src

    Visual mode bindings

    #+begin_src emacs-lisp :tangle "my-modules/my-magit.el" :mkdirp yes
      (evil-define-key '(normal visual) magit-status-mode-map
    	(kbd "s") 'magit-stage
    	(kbd "u") 'magit-unstage)
    #+end_src

*** Log mode
    Normal mode bindings

    #+begin_src emacs-lisp :tangle "my-modules/my-magit.el" :mkdirp yes
      (evil-define-key '(normal motion) magit-log-mode-map
    	(kbd "q") 'magit-log-bury-buffer
    	(kbd "j") 'magit-next-line
    	(kbd "k") 'magit-previous-line
    	(kbd "}") 'magit-section-forward
    	(kbd "{") 'magit-section-backward
    	(kbd "RET") 'magit-show-commit)
    #+end_src

*** Revision mode
    The revision mode im magit is TODO (what actual part of magit does this even relate to?)
    
    #+begin_src emacs-lisp :tangle "my-modules/my-magit.el" :mkdirp yes
      (evil-define-key '(normal motion) magit-revision-mode-map
	(kbd "j") 'magit-next-line
	(kbd "k") 'magit-previous-line
	(kbd "}") 'magit-section-forward
	(kbd "{") 'magit-section-backward
	(kbd "TAB") 'magit-section-toggle
	(kbd "RET") 'magit-visit-thing
	(kbd "q") 'magit-mode-bury-buffer)
    #+end_src

** Provide my-magit
   #+begin_src emacs-lisp :tangle "my-modules/my-magit.el" :mkdirp
     (provide 'my-magit)
   #+end_src

* Help utilities
  This encompasses man pages, info pages, describe-* windows, etc.
** Helpful package
    #+begin_src emacs-lisp :tangle "my-modules/my-help.el" :mkdirp
      (straight-use-package 'helpful)

      (evil-define-key '(normal motion) helpful-mode-map
	(kbd "q") #'quit-window)

      (evil-define-key '(normal motion) help-mode-map
	(kbd "q") #'quit-window)
    #+end_src
** Info
*** Bindings
    #+begin_src emacs-lisp :tangle "my-modules/my-help.el" :mkdirp yes
      (evil-define-key '(normal motion) Info-mode-map
	(kbd "<tab>") 'Info-next-reference
	(kbd "S-<tab>") 'Info-prev-reference
	(kbd "RET") 'Info-follow-nearest-node
	(kbd "d") 'Info-directory
	(kbd "u") 'Info-up
	(kbd "s") 'Info-search
	(kbd "i") 'Info-index
	(kbd "a") 'info-apropos
	(kbd "q") 'quit-window

        (kbd "y y") 'Info-copy-current-node-name

	[mouse-1] 'Info-mouse-follow-nearest-node
	[follow-link] 'mouse-face
	;; goto
	(kbd "g m") 'Info-menu
	(kbd "g t") 'Info-top-node
	(kbd "g T") 'Info-toc
	(kbd "g j") 'Info-next
	(kbd "g k") 'Info-prev)
    #+end_src
** Man
*** Bindings
     #+begin_src emacs-lisp :tangle "my-modules/my-help.el" :mkdirp yes
       (evil-define-key 'normal Man-mode-map
	 (kbd "q") #'quit-window)
     #+end_src

** Provide =my-help=
   #+begin_src emacs-lisp :tangle "my-modules/my-help.el" :mkdirp yes
     (provide 'my-help)
   #+end_src

* Ibuffer
  Ibuffer is an interactive buffer viewer which allows for searching, filtering
  and acting on all of the open buffers in your session.

** Bindings
  #+begin_src emacs-lisp :tangle "my-modules/my-ibuffer.el" :mkdirp yes
    (evil-define-key '(normal motion) ibuffer-mode-map
      (kbd "<leader> x") 'execute-extended-command
      ;; navigation
      (kbd "{") 'ibuffer-backwards-next-marked
      (kbd "}") 'ibuffer-forward-next-marked
  
      ;; mark commands
      (kbd "J") 'ibuffer-jump-to-buffer
      (kbd "m") 'ibuffer-mark-forward
      (kbd "~") 'ibuffer-toggle-marks
      (kbd "u") 'ibuffer-unmark-forward
      (kbd "DEL") 'ibuffer-unmark-backward
      (kbd "* *") 'ibuffer-mark-special-buffers
      (kbd "U") 'ibuffer-unmark-all-marks
      (kbd "* m") 'ibuffer-mark-by-mode
      (kbd "* M") 'ibuffer-mark-modified-buffers
      (kbd "* r") 'ibuffer-mark-read-only-buffers
      (kbd "* /") 'ibuffer-mark-dired-buffers
      (kbd "* h") 'ibuffer-mark-help-buffers
      (kbd "d") 'ibuffer-mark-for-delete
  
      ;; actions
      (kbd "x") 'ibuffer-do-kill-on-deletion-marks
      (kbd "gr") 'ibuffer-update
  
      ;; immediate actions
      (kbd "A") 'ibuffer-do-view
      (kbd "D") 'ibuffer-do-delete
      (kbd "K") 'ibuffer-do-kill-lines)
  #+end_src

** Provide =my-ibuffer=
  #+begin_src emacs-lisp :tangle "my-modules/my-ibuffer.el" :mkdirp yes
    (provide 'my-ibuffer)
  #+end_src

* Bindings
